Tekla Open API Reference for Tekla Structures 2025
AnalysisModelGeneralProperties Class
 The AnalysisModelGeneralProperties class contains the general property information for an analysis model.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisModelGeneralProperties
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisModelGeneralProperties
Public NotInheritable Class AnalysisModelGeneralProperties
The AnalysisModelGeneralProperties type exposes the following members.
Constructors
Name | Description
AnalysisModelGeneralProperties
 Creates a new analysis model general properties instance.
Top
Properties
Name | Description
AnalysisEngineName
 The name of the analysis engine.
ExtendedClashCheck
 Defines whether the extended clash check is used.
FilterName
 The name of the filter.
MemberAxisLocation
 The location of the member axis.
MemberEndReleaseMethodByConnection
 Defines whether the support conditions of connections or parts are used.
ModalAnalysisModel
 Defines whether the modal analysis properties are used instead of the static load combinations.
ModelCreationType
 The model creation type.
ModelMerging
 Defines whether the model merging is used.
ModelName
 The name of the model.
NodeDefinition
 Defines how the nodes and node positions are defined.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace